app/controllers/attendences_controller.rb

  def index

    unless params[:id].blank?
      begin
        @month_start = params[:id].to_date.at_beginning_of_month
        @month_end = params[:id].to_date.at_end_of_month
      rescue
        @month_start = Date.today.at_beginning_of_month
        @month_end = Date.today.at_end_of_month
      end
    else
      @month_start = Date.today.at_beginning_of_month
      @month_end = Date.today.at_end_of_month
    end
    @attendences = Attendence.find(:all, :conditions => {:today => @month_start.at_beginning_of_month..@month_end.at_end_of_month})
---
SELECT * FROM `attendences` WHERE (`attendences`.`today` IN ('--- !ruby/range \nbegin: 2010-06-01\nend: 2010-06-30\nexcl: false\n'))

  def show
    @attendence = Attendence.find(params[:id])
---
SELECT * FROM `attendences` WHERE (`attendences`.`id` = 2)

  def edit
    @attendence = Attendence.find(params[:id])
---
SELECT * FROM `attendences` WHERE (`attendences`.`id` = 2)

  def destroy
    @attendence = Attendence.find(params[:id])
    @attendence.destroy
---
SELECT * FROM `attendences` WHERE (`attendences`.`id` = 1)
DELETE FROM `attendences` WHERE `id` = 1