app/controllers/tasks_controller.rb

SELECT * FROM `tasks`
---
  def index
    @tasks = Task.all

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
---
  def show
    @task = Task.find(params[:id])

INSERT INTO `tasks` (`completed_at`, `time_taken`, `created_at`, `title`, `updated_at`, `priority`, `estimated_time`, `description`, `status_id`, `started_at`, `actual_time`) VALUES(NULL, NULL, '2010-05-15 10:45:12', 'do the work daily 5 hours', '2010-05-15 10:45:12', 'None', 5, 'jgklj sjdkgj sjkg sdjkg\r\ndg jsdkljgkljsd g\r\nsd gkjsd gs\r\ngklsdj gjsd\r\ng sdjklgj sdjg\r\nsd gjklsjdg\r\nd gjsdkjg\r\njsdklgj sd\r\njdklksdjkgjksdjkgjkdsjkgjksdjkjggdddddddddddd\r\ndddddddddddddddddddd\r\ndddddddddddddddaaaaaaaaaaaa\r\nssssssssssss\r\nssssssss', NULL, NULL, NULL)
---
  def create
    @task = Task.new(params[:task])
    @task.status_id = 1
    respond_to do |format|
      if @task.save